// =========================================================
// А что если...
// =========================================================
console.log("F.prototype");

let animal = {
    eats: true
};

function Rabbit(name) {
    this.name = name;
}

Rabbit.prototype = animal;

let rabbit = new Rabbit("White Rabbit"); // rabbit.__proto__ == animal

alert(rabbit.eats);
// true

// =========================================================
// Задание №1
// =========================================================


// =========================================================
// Codewars
// =========================================================
