//=========================================================
// А что если...
//=========================================================
// let student = {
//     name: "Bogdan",
//     age: 18,
//     isAdmin: false,
//     courses: ["Практика", "Алгебра", "Геометрия"],
//     wife: null,
//     room: {
//         number: 23,
//         participants: ["john", "ann"]
//     }
// };

// let json = JSON.stringify(student);

// alert(json)



//=========================================================
// Задание №1
//=========================================================
let user = {
    name: "Василий Иванович",
    age: 35,
};

let json = JSON.stringify(user);

alert(typeof json)
alert(json)

alert(JSON.parse(json));

//=========================================================
// Codewars
//=========================================================
