// =========================================================
// А что если...
// =========================================================
console.log("Встроенные прототипы");


let obj = {};
// alert(obj)


let now = new Date();

// console.dir(now.getMonth());

String.prototype.show = function () {
    alert(this);
};

// "BOOM!".show();

// =========================================================
// Задание №1 Добавить функциям метод "f.defer(ms)"
// =========================================================

function f() {
    alert("Hello!");
}

Function.prototype.defer = function () {
    setTimeout(this, 1000);
}

// f.defer(1000);


// =========================================================
// Задание №2 Добавить функциям декорирующий метод "defer()"
// =========================================================
Function.prototype.defer = function (ms) {
    let f = this;
    return function (...args) {
        setTimeout(() => f.apply(this, args), ms);
    }
};


function f(a, b) {
    alert(a + b);
}

f.defer(1000)(1, 2);


// =========================================================
// Codewars
// =========================================================
