let user = {
    name: "Sasha",
    age: 8,
    mark: 3,
};


// Можно писать так ====================================
// let clone = {};
// Object.assign(clone, user);
// =====================================================

// А можно так: ========================================
let clone = Object.assign({}, user);
// =====================================================
// alert(clone["name"]);
// clone.name = "Bogdan";
// alert(clone["name"]);
// alert(user["name"]);

// Примечание: Object.assign не делает "глубокое клонирование".
// Для этого мы должны использовать другие методы, например, рекурсию или готовые библиотеки
