// =========================================================
// А что если...
// =========================================================
console.log("Методы прототипов, объекты без свойства __proto__");


// Следует повторить эти главы ещё раз немного позже,
// так как я побыстрее хочу добраться до классов и из-за этого осознанно пропустил задания

// А классы мне нужны, чтобы скорее начать изучать React хотя бы на базовом уровне

// =========================================================
// Задание №1
// =========================================================


// =========================================================
// Codewars
// =========================================================
